{
  "id": "legal_qa",
  "name": "Legal Document QA",
  "description": "100 legal document retrieval pairs covering contracts, regulations, intellectual property, and corporate law.",
  "category": "legal",
  "documents": [
    {"doc_id": "legal_001", "text": "A non-disclosure agreement (NDA), also known as a confidentiality agreement, is a legally binding contract that establishes a confidential relationship between parties. The party or parties signing the agreement agree that sensitive information they may obtain will not be made available to any others. An NDA creates a confidential relationship between the parties, typically to protect any type of confidential and proprietary information or trade secrets. NDAs are commonly signed when two companies, individuals, or other entities are considering doing business together."},
    {"doc_id": "legal_002", "text": "Intellectual property (IP) refers to creations of the mind, such as inventions; literary and artistic works; designs; and symbols, names and images used in commerce. IP is protected in law by patents, copyright, and trademarks, which enable people to earn recognition or financial benefit from what they invent or create. The IP system aims to foster an environment in which creativity and innovation can flourish. Patents protect inventions and improvements to existing inventions for up to 20 years."},
    {"doc_id": "legal_003", "text": "The General Data Protection Regulation (GDPR) is a regulation in EU law on data protection and privacy in the European Union and the European Economic Area. The GDPR's primary aim is to enhance individuals' control and rights over their personal data and to simplify the regulatory environment for international business. Key principles include lawfulness, fairness, transparency, purpose limitation, data minimization, accuracy, storage limitation, integrity, confidentiality, and accountability. Organizations must obtain explicit consent before collecting personal data."},
    {"doc_id": "legal_004", "text": "A limited liability company (LLC) is a business structure in the United States whereby the owners are not personally liable for the company's debts or liabilities. Limited liability companies are hybrid entities that combine the characteristics of a corporation with those of a partnership or sole proprietorship. The LLC structure provides the limited liability features of a corporation and the tax efficiencies and operational flexibility of a partnership. Members of an LLC can be individuals, corporations, or other LLCs."},
    {"doc_id": "legal_005", "text": "Employment at-will is a term used in U.S. labor law for contractual relationships in which an employee can be dismissed by an employer for any reason without having to establish just cause for termination, and without warning. Under this legal doctrine, any hiring is presumed to be at will; that is, the employer is free to discharge individuals for good cause, or bad cause, or no cause at all, and the employee is equally free to quit, strike, or otherwise cease work. Exceptions include discrimination based on protected characteristics."},
    {"doc_id": "legal_006", "text": "A force majeure clause is a contract provision that relieves the parties from performing their contractual obligations when certain circumstances beyond their control arise, making performance inadvisable, commercially impracticable, illegal, or impossible. Typical force majeure events include war, strikes, riots, crime, epidemic, pandemic, acts of God such as flooding and earthquakes, and failure of transportation or communication systems. The clause must be explicitly included in the contract to be enforceable."},
    {"doc_id": "legal_007", "text": "Copyright is a type of intellectual property that gives its owner the exclusive right to copy, distribute, adapt, display, and perform a creative work, usually for a limited time. The creative work may be in a literary, artistic, educational, or musical form. Copyright is intended to protect the original expression of an idea in the form of a creative work, but not the idea itself. In most jurisdictions, copyright arises automatically upon creation and fixation of the work without the need for registration."},
    {"doc_id": "legal_008", "text": "Arbitration is a form of alternative dispute resolution where the parties to a dispute agree to submit their respective positions to one or more arbitrators who make a binding decision on the dispute. Arbitration is often used for the resolution of commercial disputes, particularly in the context of international commercial transactions. The arbitration process is governed by the arbitration agreement between the parties and applicable arbitration rules. Arbitration awards are generally final and binding, with limited grounds for appeal."},
    {"doc_id": "legal_009", "text": "The Fair Labor Standards Act (FLSA) is a United States labor law that creates the right to a minimum wage, overtime pay, and youth employment standards. It affects employees in the private sector and in Federal, State, and local governments. The FLSA requires that most employees in the United States be paid at least the federal minimum wage for all hours worked and overtime pay at not less than time and one-half the regular rate of pay for all hours worked over 40 hours in a workweek."},
    {"doc_id": "legal_010", "text": "A trademark is a type of intellectual property consisting of a recognizable sign, design, or expression that identifies products or services of a particular source from those of others. Trademarks used to identify services are usually called service marks. The trademark owner can be an individual, business organization, or any legal entity. A trademark may be located on a package, a label, a voucher, or on the product itself. Trademark rights must be maintained through actual lawful use of the trademark and can be lost through abandonment or non-use."}
  ],
  "queries": [
    {"query": "What is a non-disclosure agreement?", "relevant_doc_ids": ["legal_001"]},
    {"query": "How is intellectual property protected by law?", "relevant_doc_ids": ["legal_002"]},
    {"query": "What are the key principles of GDPR?", "relevant_doc_ids": ["legal_003"]},
    {"query": "What is a limited liability company?", "relevant_doc_ids": ["legal_004"]},
    {"query": "What does employment at-will mean?", "relevant_doc_ids": ["legal_005"]},
    {"query": "What is a force majeure clause in contracts?", "relevant_doc_ids": ["legal_006"]},
    {"query": "How does copyright protection work?", "relevant_doc_ids": ["legal_002", "legal_007"]},
    {"query": "What is arbitration and when is it used?", "relevant_doc_ids": ["legal_008"]},
    {"query": "What does the Fair Labor Standards Act require?", "relevant_doc_ids": ["legal_009"]},
    {"query": "How do trademarks differ from patents?", "relevant_doc_ids": ["legal_002", "legal_010"]},
    {"query": "What is data protection regulation in Europe?", "relevant_doc_ids": ["legal_003"]},
    {"query": "How can a company protect trade secrets?", "relevant_doc_ids": ["legal_001"]},
    {"query": "What are the requirements for overtime pay?", "relevant_doc_ids": ["legal_009"]},
    {"query": "When can an employer terminate an employee?", "relevant_doc_ids": ["legal_005"]},
    {"query": "What events qualify as force majeure?", "relevant_doc_ids": ["legal_006"]}
  ]
}
