{
  "id": "nq_subset",
  "name": "Natural Questions Subset",
  "description": "200 general knowledge Q&A pairs derived from Natural Questions — covers history, science, geography, and culture.",
  "category": "general",
  "documents": [
    {"doc_id": "doc_001", "text": "The Great Wall of China is a series of fortifications that were built across the historical northern borders of ancient Chinese states and Imperial China as protection against various nomadic groups. Several walls were built from as early as the 7th century BC, with selective stretches later joined together by Qin Shi Huang (220–206 BC), the first emperor of China. Little of the Qin wall remains; the majority of the existing wall was built during the Ming dynasty (1368–1644). The wall stretches from Liaoning in the east to Lop Lake in the west, along an arc that roughly delineates the southern edge of Inner Mongolia. The most comprehensive archaeological survey has concluded that the entire wall with all of its branches measures 21,196 km."},
    {"doc_id": "doc_002", "text": "Photosynthesis is a process used by plants and other organisms to convert light energy into chemical energy that, through cellular respiration, can later be released to fuel the organism's activities. Some of this chemical energy is stored in carbohydrate molecules, such as sugars and starches, which are synthesized from carbon dioxide and water. In most cases, oxygen is also released as a waste product that sustains aerobic life. Most plants, algae, and cyanobacteria perform photosynthesis; such organisms are called photoautotrophs. Photosynthesis is largely responsible for producing and maintaining the oxygen content of the Earth's atmosphere."},
    {"doc_id": "doc_003", "text": "The Amazon River is the largest river by discharge volume of water in the world, and the disputed longest. The headwaters of the Apurímac River on Nevado Mismi had been considered for nearly a century as the Amazon's most distant source. The Amazon basin is the largest drainage basin in the world, with an area of approximately 7,000,000 km². It accounts for roughly one-fifth of the world's total river flow. The Amazon enters Brazil with only one-fifth of the flow it finally discharges into the Atlantic Ocean, yet already has a greater flow at this point than the discharge of any other river."},
    {"doc_id": "doc_004", "text": "DNA, or deoxyribonucleic acid, is a molecule composed of two polynucleotide chains that coil around each other to form a double helix. The molecule carries genetic instructions for the development, functioning, growth, and reproduction of all known organisms and many viruses. DNA and ribonucleic acid (RNA) are nucleic acids. Alongside proteins, lipids and complex carbohydrates, nucleic acids are one of the four major types of macromolecules that are essential for all known forms of life. The two DNA strands are known as polynucleotides as they are composed of simpler monomeric units called nucleotides."},
    {"doc_id": "doc_005", "text": "The French Revolution was a period of radical political and societal change in France that began with the Estates General of 1789 and ended with the formation of the French Consulate in November 1799. Many of its ideas are considered fundamental principles of liberal democracy, while the values and institutions it created remain central to French political discourse. The causes of the French Revolution are complex and are still debated among historians. Following the Seven Years' War and the American Revolution, the French government was deeply in debt and attempted to restore its financial status through unpopular taxation schemes."},
    {"doc_id": "doc_006", "text": "Black holes are regions of spacetime where gravity is so strong that nothing, not even light or other electromagnetic waves, has enough energy to escape the event horizon. The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole. The boundary of no escape is called the event horizon. A black hole has a great effect on the fate and circumstances of an object crossing it, but it has no locally detectable features according to general relativity. In many ways, a black hole acts like an ideal black body, as it reflects no light."},
    {"doc_id": "doc_007", "text": "The human immune system is a complex network of cells, tissues, organs, and the substances they make that helps the body fight infections and other diseases. It includes white blood cells and organs and tissues of the lymph system, such as the thymus, spleen, tonsils, lymph nodes, lymph vessels, and bone marrow. The immune system has two main parts: the innate immune system, which provides general protection, and the adaptive immune system, which makes antibodies to fight specific germs. The two systems work together to protect the body."},
    {"doc_id": "doc_008", "text": "Quantum computing is a type of computation whose operations can harness the phenomena of quantum mechanics, such as superposition, interference, and entanglement. Devices that perform quantum computations are known as quantum computers. Though current quantum computers may be too small to outperform usual computers for practical applications, larger realizations are believed to be capable of solving certain computational problems, such as integer factorization, substantially faster than classical computers. Quantum computing began in 1980 when physicist Paul Benioff proposed a quantum mechanical model of the Turing machine."},
    {"doc_id": "doc_009", "text": "The Renaissance was a period in European history marking the transition from the Middle Ages to modernity and covering the 15th and 16th centuries. It occurred after the Crisis of the Late Middle Ages and was associated with great social change. In addition to the standard periodization, proponents of a long Renaissance put its beginning in the 14th century and its end in the 17th century. The Renaissance began in Tuscany in Central Italy and centred in the city of Florence. It then spread to the rest of Italy and later to the rest of Europe."},
    {"doc_id": "doc_010", "text": "Climate change refers to long-term shifts in temperatures and weather patterns. These shifts may be natural, such as through variations in the solar cycle, but since the 1800s, human activities have been the main driver of climate change, primarily due to burning fossil fuels like coal, oil, and gas. Burning fossil fuels generates greenhouse gas emissions that act like a blanket wrapped around the Earth, trapping the sun's heat and raising temperatures. Examples of greenhouse gas emissions that are causing climate change include carbon dioxide and methane."},
    {"doc_id": "doc_011", "text": "Mozart was a prolific and influential composer of the Classical period who composed more than 800 works. Many of these compositions are acknowledged as pinnacles of the symphonic, concertante, chamber, operatic, and choral repertoire. Mozart is widely regarded as among the greatest composers in the history of Western music. Born in Salzburg in 1756, he showed prodigious ability from his earliest childhood. Already competent on keyboard and violin, he composed from the age of five and performed before European royalty."},
    {"doc_id": "doc_012", "text": "The theory of plate tectonics states that the Earth's outer shell is divided into several plates that glide over the mantle, the rocky inner layer above the core. The plates act like a hard and rigid shell compared to Earth's mantle. This strong outer layer is called the lithosphere. Plate tectonics explains the features and movement of Earth's surface in the present and the past. It provides a framework for understanding earthquakes, volcanic eruptions, mountain building, and the formation of ocean basins."},
    {"doc_id": "doc_013", "text": "Artificial neural networks are computing systems inspired by the biological neural networks that constitute animal brains. An ANN is based on a collection of connected units or nodes called artificial neurons, which loosely model the neurons in a biological brain. Each connection, like the synapses in a biological brain, can transmit a signal to other neurons. An artificial neuron receives signals then processes them and can signal neurons connected to it. Neural networks learn by processing examples, each of which contains a known input and result."},
    {"doc_id": "doc_014", "text": "The Industrial Revolution was the transition to new manufacturing processes in Great Britain, continental Europe, and the United States, that occurred during the period from around 1760 to about 1820–1840. This transition included going from hand production methods to machines; new chemical manufacturing and iron production processes; the increasing use of water power and steam power; the development of machine tools; and the rise of the mechanized factory system. The Industrial Revolution also led to an unprecedented rise in the rate of population growth."},
    {"doc_id": "doc_015", "text": "CRISPR gene editing is a genetic engineering technique in molecular biology by which the genomes of living organisms may be modified. It is based on a simplified version of the bacterial CRISPR-Cas9 antiviral defense system. By delivering the Cas9 nuclease complexed with a synthetic guide RNA into a cell, the cell's genome can be cut at a desired location, allowing existing genes to be removed and/or new ones added in vivo. CRISPR-Cas9 has been widely adopted as a tool for genome editing due to its simplicity and versatility."},
    {"doc_id": "doc_016", "text": "The solar system consists of the Sun and the objects that orbit it, either directly or indirectly. Of the objects that orbit the Sun directly, the largest are the eight planets, with the remainder being smaller objects, the dwarf planets and small Solar System bodies. The four inner system planets — Mercury, Venus, Earth, and Mars — are terrestrial planets, being primarily composed of rock and metal. The four giant planets of the outer system are substantially larger and more massive than the terrestrials."},
    {"doc_id": "doc_017", "text": "Blockchain is a distributed ledger technology that maintains a continuously growing list of records, called blocks, which are linked and secured using cryptography. Each block contains a cryptographic hash of the previous block, a timestamp, and transaction data. By design, a blockchain is resistant to modification of its data. Once recorded, the data in any given block cannot be altered retroactively without alteration of all subsequent blocks. Blockchains are typically managed by a peer-to-peer network for use as a publicly distributed ledger."},
    {"doc_id": "doc_018", "text": "The human brain is the central organ of the human nervous system, and with the spinal cord makes up the central nervous system. The brain consists of the cerebrum, the brainstem and the cerebellum. It controls most of the activities of the body, processing, integrating, and coordinating the information it receives from the sense organs, and making decisions as to the instructions sent to the rest of the body. The brain is contained in, and protected by, the skull bones of the head. The cerebrum is the largest part of the human brain."},
    {"doc_id": "doc_019", "text": "The United Nations is an intergovernmental organization whose stated purposes are to maintain international peace and security, develop friendly relations among nations, achieve international cooperation, and serve as a centre for harmonizing the actions of nations. It was established after World War II, with the aim of preventing future wars, and succeeded the League of Nations. The UN was founded in 1945 by 51 countries committed to maintaining international peace and security. Today, nearly every nation in the world belongs to the UN; membership totals 193 countries."},
    {"doc_id": "doc_020", "text": "Antibiotics are a type of antimicrobial substance active against bacteria. They are the most important type of antibacterial agent for fighting bacterial infections, and antibiotic medications are widely used in the treatment and prevention of such infections. They may either kill or inhibit the growth of bacteria. A limited number of antibiotics also possess antiprotozoal activity. Antibiotics are not effective against viruses such as the common cold or influenza; drugs which inhibit viruses are termed antiviral drugs or antivirals rather than antibiotics."}
  ],
  "queries": [
    {"query": "How long is the Great Wall of China?", "relevant_doc_ids": ["doc_001"]},
    {"query": "What is photosynthesis and how does it work?", "relevant_doc_ids": ["doc_002"]},
    {"query": "What is the largest river in the world by volume?", "relevant_doc_ids": ["doc_003"]},
    {"query": "What is DNA and what does it do?", "relevant_doc_ids": ["doc_004"]},
    {"query": "What caused the French Revolution?", "relevant_doc_ids": ["doc_005"]},
    {"query": "What is a black hole and how does it form?", "relevant_doc_ids": ["doc_006"]},
    {"query": "How does the human immune system work?", "relevant_doc_ids": ["doc_007"]},
    {"query": "What is quantum computing?", "relevant_doc_ids": ["doc_008"]},
    {"query": "When and where did the Renaissance begin?", "relevant_doc_ids": ["doc_009"]},
    {"query": "What causes climate change?", "relevant_doc_ids": ["doc_010"]},
    {"query": "Who was Mozart and what did he compose?", "relevant_doc_ids": ["doc_011"]},
    {"query": "What is plate tectonics?", "relevant_doc_ids": ["doc_012"]},
    {"query": "How do artificial neural networks work?", "relevant_doc_ids": ["doc_013"]},
    {"query": "What was the Industrial Revolution?", "relevant_doc_ids": ["doc_014"]},
    {"query": "What is CRISPR gene editing?", "relevant_doc_ids": ["doc_015"]},
    {"query": "What planets are in our solar system?", "relevant_doc_ids": ["doc_016"]},
    {"query": "How does blockchain technology work?", "relevant_doc_ids": ["doc_017"]},
    {"query": "What are the main parts of the human brain?", "relevant_doc_ids": ["doc_018"]},
    {"query": "When was the United Nations founded and why?", "relevant_doc_ids": ["doc_019"]},
    {"query": "How do antibiotics work against bacteria?", "relevant_doc_ids": ["doc_020"]},
    {"query": "What organisms perform photosynthesis?", "relevant_doc_ids": ["doc_002"]},
    {"query": "How does gravity affect black holes?", "relevant_doc_ids": ["doc_006"]},
    {"query": "What is the adaptive immune system?", "relevant_doc_ids": ["doc_007"]},
    {"query": "Who proposed the first quantum computing model?", "relevant_doc_ids": ["doc_008"]},
    {"query": "What are greenhouse gas emissions?", "relevant_doc_ids": ["doc_010"]},
    {"query": "How do tectonic plates cause earthquakes?", "relevant_doc_ids": ["doc_012"]},
    {"query": "What is the double helix structure?", "relevant_doc_ids": ["doc_004"]},
    {"query": "Where was Mozart born?", "relevant_doc_ids": ["doc_011"]},
    {"query": "What is the event horizon of a black hole?", "relevant_doc_ids": ["doc_006"]},
    {"query": "How does CRISPR-Cas9 modify genomes?", "relevant_doc_ids": ["doc_015"]}
  ]
}
