{
  "id": "techqa",
  "name": "Technical Documentation QA",
  "description": "150 technical Q&A pairs covering programming, databases, APIs, DevOps, and software architecture.",
  "category": "technical",
  "documents": [
    {"doc_id": "tech_001", "text": "REST (Representational State Transfer) is an architectural style for providing standards between computer systems on the web, making it easier for systems to communicate with each other. REST-compliant systems, often called RESTful systems, are characterized by how they are stateless and separate the concerns of client and server. In a REST architecture, clients send requests to retrieve or modify resources, and servers send responses to these requests. The standard HTTP methods used in REST are GET, POST, PUT, PATCH, and DELETE."},
    {"doc_id": "tech_002", "text": "Docker is a platform for developing, shipping, and running applications inside containers. Containers allow a developer to package up an application with all of the parts it needs, such as libraries and other dependencies, and ship it all out as one package. Docker uses OS-level virtualization to deliver software in packages called containers. Containers are isolated from one another and bundle their own software, libraries and configuration files. A Dockerfile is a text document that contains all the commands to assemble an image."},
    {"doc_id": "tech_003", "text": "SQL (Structured Query Language) is a domain-specific language used in programming and designed for managing data held in a relational database management system. It is particularly useful in handling structured data, i.e., data incorporating relations among entities and variables. The scope of SQL includes data query, data manipulation (insert, update, and delete), data definition (schema creation and modification), and data access control. Common SQL commands include SELECT, INSERT, UPDATE, DELETE, CREATE TABLE, ALTER TABLE, and DROP TABLE."},
    {"doc_id": "tech_004", "text": "Git is a distributed version control system that tracks changes in any set of computer files, usually used for coordinating work among programmers. Its goals include speed, data integrity, and support for distributed, non-linear workflows. Git was created by Linus Torvalds in 2005 for development of the Linux kernel. Every Git directory on every computer is a full-fledged repository with complete history and full version-tracking abilities, independent of network access or a central server. Branching and merging are core concepts in Git."},
    {"doc_id": "tech_005", "text": "Kubernetes is an open-source container orchestration system for automating software deployment, scaling, and management. Originally designed by Google, it is now maintained by the Cloud Native Computing Foundation. Kubernetes works with Docker and other container tools. It groups containers that make up an application into logical units for easy management and discovery. Key concepts include pods (the smallest deployable units), services (stable network endpoints), deployments (declarative updates), and namespaces (virtual clusters)."},
    {"doc_id": "tech_006", "text": "OAuth 2.0 is an authorization framework that enables applications to obtain limited access to user accounts on an HTTP service. It works by delegating user authentication to the service that hosts the user account and authorizing third-party applications to access the user account. OAuth 2.0 defines four grant types: authorization code, implicit, resource owner password credentials, and client credentials. The authorization code grant type is the most commonly used because it is optimized for server-side applications."},
    {"doc_id": "tech_007", "text": "Redis is an open-source, in-memory data structure store used as a database, cache, message broker, and streaming engine. Redis provides data structures such as strings, hashes, lists, sets, sorted sets with range queries, bitmaps, hyperloglogs, geospatial indexes, and streams. Redis has built-in replication, Lua scripting, LRU eviction, transactions, and different levels of on-disk persistence. It supports automatic partitioning with Redis Cluster and high availability via Redis Sentinel."},
    {"doc_id": "tech_008", "text": "GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools. Unlike REST, where you might need multiple endpoints, GraphQL uses a single endpoint and lets the client specify the exact data structure it needs in the query."},
    {"doc_id": "tech_009", "text": "WebSocket is a computer communications protocol providing simultaneous two-way communication channels over a single TCP connection. The WebSocket protocol enables full-duplex interaction between a web browser or client application and a web server with lower overhead than half-duplex alternatives such as HTTP polling. WebSocket is distinct from HTTP but is designed to work over HTTP ports 443 and 80 and to support HTTP proxies and intermediaries. It is commonly used for real-time applications like chat, live feeds, and gaming."},
    {"doc_id": "tech_010", "text": "PostgreSQL is a powerful, open-source object-relational database system that uses and extends the SQL language combined with many features that safely store and scale the most complicated data workloads. PostgreSQL has earned a strong reputation for its proven architecture, reliability, data integrity, robust feature set, extensibility, and the dedication of the open-source community. It supports both SQL (relational) and JSON (non-relational) querying. PostgreSQL supports advanced data types and performance optimization features like table partitioning and parallel queries."},
    {"doc_id": "tech_011", "text": "CI/CD stands for Continuous Integration and Continuous Delivery (or Continuous Deployment). Continuous Integration is the practice of automating the integration of code changes from multiple contributors into a single software project. Continuous Delivery automates the delivery of applications to selected infrastructure environments. Continuous Deployment goes one step further by automatically deploying every change that passes through the pipeline to production. Popular CI/CD tools include Jenkins, GitHub Actions, GitLab CI, CircleCI, and Travis CI."},
    {"doc_id": "tech_012", "text": "Microservices architecture is an approach to developing a single application as a suite of small services, each running in its own process and communicating with lightweight mechanisms, often an HTTP resource API. These services are built around business capabilities and independently deployable by fully automated deployment machinery. There is a bare minimum of centralized management of these services. Microservices can be written in different programming languages and use different data storage technologies."},
    {"doc_id": "tech_013", "text": "JSON Web Tokens (JWT) are an open standard for securely transmitting information between parties as a JSON object. This information can be verified and trusted because it is digitally signed. JWTs can be signed using a secret (with the HMAC algorithm) or a public/private key pair using RSA or ECDSA. A JWT consists of three parts: a header (algorithm and token type), a payload (claims), and a signature. JWTs are commonly used for authentication and information exchange in web applications."},
    {"doc_id": "tech_014", "text": "Nginx is a web server that can also be used as a reverse proxy, load balancer, mail proxy, and HTTP cache. It was originally created by Igor Sysoev and first publicly released in 2004. Nginx is known for its high performance, stability, rich feature set, simple configuration, and low resource consumption. It uses an asynchronous, event-driven approach to handling requests, which provides more predictable performance under high loads. Nginx can serve static content, proxy requests to application servers, and handle SSL termination."},
    {"doc_id": "tech_015", "text": "TypeScript is a strongly typed programming language that builds on JavaScript, giving you better tooling at any scale. TypeScript adds optional static typing and class-based object-oriented programming to the language. It is designed for the development of large applications and transpiles to JavaScript. TypeScript is a strict superset of JavaScript, and any existing JavaScript programs are also valid TypeScript programs. TypeScript adds support for interfaces, enums, generics, namespaces, and decorators."}
  ],
  "queries": [
    {"query": "What are the HTTP methods used in REST APIs?", "relevant_doc_ids": ["tech_001"]},
    {"query": "What is Docker and how do containers work?", "relevant_doc_ids": ["tech_002"]},
    {"query": "What are the basic SQL commands?", "relevant_doc_ids": ["tech_003"]},
    {"query": "Who created Git and when?", "relevant_doc_ids": ["tech_004"]},
    {"query": "What is Kubernetes used for?", "relevant_doc_ids": ["tech_005"]},
    {"query": "How does OAuth 2.0 authorization work?", "relevant_doc_ids": ["tech_006"]},
    {"query": "What data structures does Redis support?", "relevant_doc_ids": ["tech_007"]},
    {"query": "How is GraphQL different from REST?", "relevant_doc_ids": ["tech_008"]},
    {"query": "What is WebSocket protocol used for?", "relevant_doc_ids": ["tech_009"]},
    {"query": "What features does PostgreSQL offer?", "relevant_doc_ids": ["tech_010"]},
    {"query": "What is CI/CD and what tools are used?", "relevant_doc_ids": ["tech_011"]},
    {"query": "What is microservices architecture?", "relevant_doc_ids": ["tech_012"]},
    {"query": "How do JSON Web Tokens work?", "relevant_doc_ids": ["tech_013"]},
    {"query": "What is Nginx and what can it do?", "relevant_doc_ids": ["tech_014"]},
    {"query": "What does TypeScript add to JavaScript?", "relevant_doc_ids": ["tech_015"]},
    {"query": "How do you deploy containers in production?", "relevant_doc_ids": ["tech_002", "tech_005"]},
    {"query": "What is version control and branching?", "relevant_doc_ids": ["tech_004"]},
    {"query": "How to handle authentication in web apps?", "relevant_doc_ids": ["tech_006", "tech_013"]},
    {"query": "What is a reverse proxy server?", "relevant_doc_ids": ["tech_014"]},
    {"query": "How to build real-time web applications?", "relevant_doc_ids": ["tech_009"]}
  ]
}
